[
    "Whoever created the tradition of not seeing the bride in the wedding dress beforehand saved countless husbands everywhere from hours of dress shopping and will forever be a hero to all men.",
    "We laugh at dogs getting excited when they hear a bark on TV, but if TV was a nonstop stream of unintelligible noises and then someone suddenly spoke to you in your language, you'd be pretty fucking startled too.",
    "When you're a kid, you don't realize you're also watching your mom and dad grow up.",
    "Dads probably bond with dogs so much because, in our society, men don’t get shown a lot of affection but dogs give tons of affection regardless",
    "Being able to tolerate the sound of your own voice in a video is probably the highest form of self acceptance.",
    "Girls don't compliment guys because they're likely to take it non-platonically, guys take it non-platonically because it happens so infrequently they don't know how to handle it",
    "If elevators hadn't been invented, all the CEOs and important people would have their offices on the first floor as a sign of status.",
    "If EA suffers big enough losses from the backlash of Battlefront 2, and it all started because some guy couldn't unlock Vader, this will be the second time Anakin brought balance to something.",
    "Being able to do well in high school without having to put in much effort is actually a big disadvantage later in life.",
    "During a nuclear explosion, there is a certain distance of the radius where all the frozen supermarket pizzas are cooked to perfection.",
    "Anxiety is like when video game combat music is playing but you can't find any enemies.",
    "Pavlov probably thought about feeding his dogs every time someone rang a bell.",
    "11 babies have been born in Antarctica, and none of them died as infants, meaning Antarctica has the lowest infant mortality rate at 0%",
    "We do not check the refrigerator multiple times to find new food, we check to see if our standards have dropped enough to eat what was available.",
    "The sentence \"Don't objectify women\" has \"women\" as the object of the sentence.",
    "Somebody at google was just like \"yea, just have someone drive down every road on fucking earth\".",
    "College students don't want to go to graduation ceremonies, but they go to please their relatives, while relatives don't want to go but go to support the students; we should all just be honest and skip that ceremony and go out for pizza.",
    "There is probably at least one white guy, adopted and raised in China, who speaks English with a Chinese accent and strangers just assume he’s a total asshole",
    "Apparently, a lemon is not naturally occurring and is a hybrid developed by cross breeding a bitter orange and a citron. Life never gave us lemons; we invented them all by ourselves.",
    "Being 35 and not wanting to work in the field for which you've prepared is like being half way through an RPG and realizing you've built out your skill tree all wrong and you can't respec and you can't make a new character and there will never be another video game again",
    "It would be cool if after you died you could see the top 5 times you almost died.",
    "It kinda makes sense that the target audience for fidget spinners lost interest in them so quickly",
    "Avatar, the highest grossing film of all time, seems to have made zero impact on culture. No one references the movie and no one really talks about it since it was released 10 years ago.",
    "A guy named \"Weird Al\" has had a 40+ year long career with no allegations of sexual impropriety.",
    "We all think of Gordon Ramsay as an extremely picky food critic/chef but if your life's work was cooking and you saw a narcissistic restaurant manager breaking health code violations and making horrible food, you'd be pretty angry too.",
    "In the anime, Ash Ketchum was supposed to be a huge Pokémon fan before he left on his journey. But every time he sees any kind of Pokémon, he has to pull out his Pokédex because he doesn’t know what it is. Ash Ketchum was a poser before he left on his journey.",
    "Since there are 3600 seconds in an hour, and most people make less than $36.00/hr, their time is worth less than a penny per second. It's literally worth your time to pick up a penny from the ground.",
    "The syllables in “on your mark, get set, go” are a countdown",
    "Security at every level of an airport is absolutely ridiculous. Until you get to the baggage claim. Then it’s just like take whatever bag you want.",
    "Being a real grown up isn’t cooking a fancy dinner, it’s having a clean kitchen when you go to bed after cooking a fancy dinner.",
    "Most of the trash you see on the ground is unhealthy food packaging because people who don’t care about their own health don’t care about the Earth’s either.",
    "Lamps in Videogames use real electricity.",
    "Reddit Is Killing Third-Party Applications (And Itself)",
    "Coffee makes you hyper, but coffee shops are designed for people to chill, whereas alcohol is a depressant but bars and clubs are designed for people to be energetic.",
    "Stan Lee’s funeral is going to be a reverse cameo where all the superheroes appear in the background of his story",
    "Humans cannot even live in harmony with their own species and somehow still convince themselves that meeting an extra-terrestrial species would go smoothly",
    "The internet both almost killed off the postal service with email and then made it more needed than ever with online delivery",
    "The spiders that live in Buckingham Palace now are probably the descendants of the spiders that lived there during Victorian times - it's a whole parallel royal family but with spiders",
    "Manuals for TVs are regarded as useless, but in five thousand years they are as valuable as the Rosetta Stone: it contains the same text in over 20 different languages and alphabets.",
    "Biting your tongue while eating is a perfect example of how you can still screw up, even with decades of experience.",
    "If Eminem’s Mom wanted to she could probably make a good amount of money selling her own spaghetti sauce",
    "The biggest form of peer pressure as a kid wasn’t drugs, alcohol, or cigarettes. It came during exams when it was completely silent and you heard everyone turn to page 2 while you were still on the first question.",
    "Both sexes can fuck a Pringles can, but neither can do it well.",
    "We give rude elderly people the benefit of the doubt because they've been through a lot, but there's a decent chance that old person has been an asshole their whole life.",
    "Google earth is one of the most incredible things ever created by man but is taken for granted as if it were nothing.",
    "Thermometers are speedometers for atoms",
    "One of the most frustrating feelings in the world is being smart enough to know there’s a better way to do something but not smart enough to invent a way to do it.",
    "As a kid, teenagers seemed so big and scary because in most TV shows they were actually played by adults in their 20s.",
    "Smoking kills you, but the actual “act” of smoking is a very healthy practice - leave a stressful environment, go outside for five minutes and take deep breaths.",
    "Tinder is the opposite of porn site advertisements. There actually are a ton of hot singles in my area, but none of them are interested in me."
]